tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "louisbrunner/valgrind"
brew "libtiff"
brew "jpeg-xl"
brew "aom"
brew "bat"
brew "bear"
brew "black"
brew "boost"
brew "btop"
brew "ghc"
brew "cabal-install"
brew "freetype"
brew "pycparser"
brew "cffi"
brew "cmake"
brew "docker"
brew "docker-machine"
brew "dust"
brew "eza"
brew "fd"
brew "gcc"
brew "unbound"
brew "gnutls"
brew "openjpeg"
brew "libarchive"
brew "libmicrohttpd"
brew "librist"
brew "openblas"
brew "sdl2"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "ghcup"
brew "glew"
brew "ipython"
brew "jp2a"
brew "jq"
brew "node"
brew "jupyterlab"
brew "llvm"
brew "mupdf"
brew "ncurses"
brew "neovim"
brew "opencl-headers"
brew "pkgconf"
brew "prettierd"
brew "pybind11"
brew "qt"
brew "pyqt"
brew "python-lsp-server"
brew "python@3.11"
brew "ripgrep"
brew "silicon"
brew "suite-sparse"
brew "swig"
brew "thefuck"
brew "tmux"
brew "tokei"
brew "uv"
brew "vtk"
brew "wget"
brew "zoxide"
brew "louisbrunner/valgrind/valgrind", args: ["HEAD"]
cask "basictex"
cask "font-comic-shanns-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "iterm2"
cask "virtualbox"
vscode "esbenp.prettier-vscode"
vscode "github.github-vscode-theme"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.dotnet-interactive-vscode"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "redhat.java"
vscode "robbowen.synthwave-vscode"
vscode "seyyedkhandon.firacode"
vscode "shalldie.background"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "zhuangtongfa.material-theme"
