tap "homebrew/bundle"
tap "homebrew/cask-fonts"
brew "jpeg-xl"
brew "bat"
brew "black"
brew "btop"
brew "suite-sparse"
brew "pycparser"
brew "cffi"
brew "cmake"
brew "dust"
brew "fd"
brew "unbound"
brew "openjpeg"
brew "libmicrohttpd"
brew "sdl2"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "ipython"
brew "jq"
brew "node"
brew "jupyterlab"
brew "llvm"
brew "mupdf"
brew "ncurses"
brew "neovim"
brew "pkg-config"
brew "prettierd"
brew "qt"
brew "pyqt"
brew "python-lsp-server"
brew "ripgrep"
brew "silicon"
brew "swig"
brew "thefuck"
brew "tmux"
brew "tokei"
brew "vtk"
brew "wget"
brew "zoxide"
cask "basictex"
cask "font-comic-shanns-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "iterm2"
vscode "esbenp.prettier-vscode"
vscode "github.github-vscode-theme"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.dotnet-interactive-vscode"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vsliveshare.vsliveshare"
vscode "redhat.java"
vscode "seyyedkhandon.firacode"
vscode "shalldie.background"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "zhuangtongfa.material-theme"
